<?php
// Отримати залишок від ділення 7 на 3
echo "<p>Умова:</p>";
echo "<p>Отримати залишок від ділення 7 на 3.</p>";
echo "<p>Відповідь:</p>";
$a = (7 % 3);
print_r("Залишок від ділення 7 на 3 дорівнює" . $a) ;
echo '<hr>';

//
//Отримати цілу частину ділення 7 и 7,15
//
//Отримати корінь из 25
//
//Дії зі строкаи
//
//Отримати 4-е слово з фрази - Десять негритят пошли купаться в море
//
//Отримати 17-й символ із фрази - Десять негритят пошли купаться в море
//
//Зробити великою кожну першу букву слів фрази - Десять негритят пошли купаться в море
//
//Порахувати длину строки - Десять негритят пошли купаться в море
//
//Дії з логіческими даними
//
//Чи вірно твердження true дорівнює 1
//
//Чи вірно твердження false тождественно 0//
//$a = 1 == true;
//if ($a > 0) {
//    echo "true";
//} else{
//    echo "false";
$a = true;
$b = 1;
if ($a == $b){
    echo "true дорівнює 1";
}
elseif ($a != $b)
    echo "true  не дорівнює 1";

//
$a = false;
$b = 0;
if ($a === $b){
    echo "<p>false тождественно 0</p>";
}
elseif ($a !== $b)
    echo "false  не тождественно 0";
echo '<hr>';
//(Для вирішення цих питань потрібно опанувати рівняння то тотожність у РНР)
//
//Яка строка більше three - три
//
//Яке число більше 125 умножить на 13 плюс 7 или 223 плюс 28 умножить 2